Deman75/stm32f103_nrf24_tx/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "NRF24.h"
#include "ssd1306.h"
#include <string.h>
#include "New_CalibriLight14.h"

#define DRIVE HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_3)==GPIO_PIN_SET
#define REAR  HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4)==GPIO_PIN_SET
#define LEFT  HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_6)==GPIO_PIN_SET
#define RIGHT HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_5)==GPIO_PIN_SET

#define LED_MAIN_ON			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_SET)
#define LED_MAIN_OFF			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_14, GPIO_PIN_RESET)

#define LED_YELLOW_ON		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET)
#define LED_YELLOW_OFF  	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET)
#define LED_YELLOW_TOG   	HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13)

#define REED_BTN_1 HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_11)==GPIO_PIN_RESET
#define REED_BTN_2 HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_12)==GPIO_PIN_RESET

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
char str1[20]={0};
uint8_t buf1[20]={0}; // Буфер на отправку
extern uint8_t RX_BUF[TX_PLOAD_WIDTH+1]; // Буфер приема

volatile uint16_t ADC_Data[10]; // Для хранения данных из DMA

float ADC_1_Percent;  // АЦП Руля
float ADC_2_Percent;	// АЦП Газа
float ADC_3_Percent;
float ADC_4_Percent;
char str[20];
float Volt = 0.0; 		// Переменная напряжения в пульте
uint16_t MenuDelay=0;	// Задержка работы меню, обновления дисплея
uint8_t OptionFlag = 0; // 1 - Если перешли в режим настройки

struct But {
	uint8_t ButEvent; // 1-Короткий клик, 2-Длиный клик.
	uint8_t ButDown; // 1-Если кнопка сейчас нажата.
	uint8_t ButFlag; // 1-Если сработало нажатие
	uint8_t ButEventTime; // Время, которое висит собитек кнопки.
	uint16_t ButDownTime;//время удержания кнопки.
	uint16_t ButUpTime;
};
extern struct But But1; // Машина состояний кнопки энкодера
uint8_t Menu = 11;			// Переменная для уровней меню
uint8_t OldParam, NewParam; //Старые и новые значения настраиваемых данных
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

void MainMenu (void);
uint8_t SetResBits (uint8_t set, uint8_t value, uint8_t pos);
uint8_t CheckBits (uint8_t value, uint8_t pos);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	static uint8_t dt; // Переменная для количества попыток отправления.
	static uint16_t i=1;
	uint16_t ADC_1, ADC_1_sr, ADC_1_sr_trim, ADC_1_max=0, ADC_1_min=4096;
	uint16_t ADC_2, ADC_2_sr, ADC_2_max=0, ADC_2_min=4096;
	
	uint16_t rate = 0; //расходы газа
	int16_t trim = 0; // Тример руля
	
	uint8_t LedFlashNumb = 0;
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

