Deman75/stm32f103_nrf24_tx/Src/main.c
  /* USER CODE BEGIN Init */
	

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  /* USER CODE BEGIN 2 */
	HAL_Delay(100);
	
	
	i=0;
	while ((LCD_init() !=1)||i<50){
		i++;
		LedFlashNumb++;
		if (LedFlashNumb == 1) {
			LED_GREEN_ON;
			LED_YELLOW_OFF;
			LED_MAIN_OFF;
		} else if (LedFlashNumb == 2) {
			LED_GREEN_OFF;
			LED_YELLOW_ON;
			LED_MAIN_OFF;
		} else if (LedFlashNumb == 3) {
			LED_GREEN_OFF;
			LED_YELLOW_OFF;
			LED_MAIN_ON;
		} else if (LedFlashNumb > 3) LedFlashNumb = 0;
	}
		
	LED_MAIN_ON;
	
	HAL_ADC_Start_DMA(&hadc1,(uint32_t*) &ADC_Data,5);
	HAL_TIM_Encoder_Start(&htim1, TIM_CHANNEL_ALL);
	TIM1->CNT = 2; // Стартовое положение энкодера;
	
	NRF24_ini();
	HAL_Delay(10);
	HAL_TIM_Base_Start_IT(&htim2);
	HAL_TIM_Base_Start_IT(&htim3);
	
	
	ADC_1_max=3700;	
	ADC_1_min=205;
	ADC_1_sr_trim = 2018;
	ADC_1_sr = 2018; //50% 2018
	
	
	ADC_2_max=2800;	 
	ADC_2_min=1095;
	ADC_2_sr = 2220; // 44%

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {		
		
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	
		if (MenuDelay>5){
			MainMenu();
			MenuDelay = 0;
		}
		MenuDelay++;
		
		
//		ADC_2 = ((float)ADC_Data[0]);
//		ADC_2_Percent=(100.0/(ADC_2_max-ADC_2_min))*(ADC_2-ADC_2_min);
		
		Volt = 0.00278 * ADC_Data[2];
		
		if (OptionFlag == 0) { // если не находимся в режиме настроек.
			
			rate = (uint16_t)(0.025 * ADC_Data[3]);
			if (rate > 100 ) rate = 100;
			if (rate < 0 ) rate = 0;
			rate = 100 - rate;
			
			trim = (0.05 * (ADC_Data[4] - 2000)) + (1 - 0.05) * trim;


         ADC_1_sr = ADC_1_sr_trim + trim;
			ADC_1 = ADC_Data[1];
			
			if (ADC_1 > ADC_1_sr) {
				if (ADC_1 > ADC_1_max) ADC_1 = ADC_1_max;
				ADC_1_Percent = ((100.0) / (ADC_1_max - ADC_1_sr)) * (ADC_1 - ADC_1_sr);
				buf1[0] = 100 + (uint8_t) ADC_1_Percent;
			}
			
			if (ADC_1 < ADC_1_sr) {
				if (ADC_1 < ADC_1_min) ADC_1 = ADC_1_min;
				ADC_1_Percent = ((100.0) / (ADC_1_sr - ADC_1_min)) * (ADC_1 - ADC_1_sr);
				buf1[0] = 100 - (uint8_t) ADC_1_Percent;
			}
			
			
			ADC_2 = ADC_Data[0];
			
			if (ADC_2 > ADC_2_sr) {
				ADC_2_Percent = ((100.0 - rate) / (ADC_2_max - ADC_2_sr)) * (ADC_2 - ADC_2_sr);
				if (ADC_2_Percent > 100) ADC_2_Percent = 100;
				buf1[1] = 100 - (uint8_t) ADC_2_Percent;
			} else
				
			if (ADC_2 < ADC_2_sr) {
				ADC_2_Percent = ((100.0 - rate) / (ADC_2_sr - ADC_2_min)) * (ADC_2 - ADC_2_sr);
				if (ADC_2_Percent > 100) ADC_2_Percent = 100;
				buf1[1] = 100 + (uint8_t) ADC_2_Percent;
			}
			
			if ((ADC_2 > ADC_2_sr - 50) && (ADC_2 < ADC_2_sr + 50)) {
				buf1[1] = 100;
			}
			
			LED_YELLOW_OFF;
			
//			buf1[0] = 100;
//			buf1[1] = 100;
			
			if (REED_BTN_1) {
				buf1[2] = SetResBits(1,buf1[2],1);
			} else {
				buf1[2] = SetResBits(0,buf1[2],1);
			}
			if (REED_BTN_2) {
				buf1[2] = SetResBits(1,buf1[2],2);
			} else {
				buf1[2] = SetResBits(0,buf1[2],2);
			}
			HAL_Delay(20);
			dt = NRF24L01_Send(buf1);
		}
		else {
			HAL_Delay(10);
			LED_YELLOW_ON;
		}
		

		if ((Menu>20 && Menu<30)||OptionFlag==1)
			NRF24L01_Receive();
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /**Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /**Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV8;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */
  /**Common config 
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 5;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }
  /**Configure Regular Channel 
  */
  sConfig.Channel = ADC_CHANNEL_3;
  sConfig.Rank = ADC_REGULAR_RANK_1;
  sConfig.SamplingTime = ADC_SAMPLETIME_239CYCLES_5;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /**Configure Regular Channel 
  */
  sConfig.Channel = ADC_CHANNEL_4;
  sConfig.Rank = ADC_REGULAR_RANK_2;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /**Configure Regular Channel 
  */
  sConfig.Channel = ADC_CHANNEL_2;
  sConfig.Rank = ADC_REGULAR_RANK_3;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /**Configure Regular Channel 
  */
  sConfig.Channel = ADC_CHANNEL_1;
  sConfig.Rank = ADC_REGULAR_RANK_4;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /**Configure Regular Channel 
  */
  sConfig.Channel = ADC_CHANNEL_0;
  sConfig.Rank = ADC_REGULAR_RANK_5;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

