Deman75/stm32f103_nrf24_tx/Src/main.c
  /*Configure GPIO pins : LED_YELLOW_Pin LED_RED_Pin LED_GREEN_Pin */
  GPIO_InitStruct.Pin = LED_YELLOW_Pin|LED_RED_Pin|LED_GREEN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : NRF_CS_Pin NRF_CE_Pin */
  GPIO_InitStruct.Pin = NRF_CS_Pin|NRF_CE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : NRF_EXT_Pin */
  GPIO_InitStruct.Pin = NRF_EXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(NRF_EXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ENCODER_BTN_Pin BTN_1_Pin BTN_2_Pin */
  GPIO_InitStruct.Pin = ENCODER_BTN_Pin|BTN_1_Pin|BTN_2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin== GPIO_PIN_10)
  {
    IRQ_Callback();
  }
  else
  {
    __NOP();
  }
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  if(htim==&htim2)
  {
    TIM1_Callback();
  }
}

void MainMenu (void){
	char str[20];
	float VoltRx = 0;
	uint8_t i=0;
	
	if (But1.ButEvent == 1 && (Menu == 11 || Menu == 21 || Menu == 31)) {
		Menu += 10;
		if (Menu > 40)
			Menu -= 30;
		But1.ButEvent = 0;
	}
//======================= Первый уровень меню ==========================
	if (Menu>10 && Menu<20) {
	
		LCD_RectFill(1,1,32,128,0x00);
		LCD_BarHorizont(1,1,5,50,buf1[0]/2,0x01,0x00);
		sprintf(str,"Ch1 = %d", buf1[0]);
//		sprintf(str,"Ch1 = %d", ADC_Data[1]);
		StringCalibriLight14(6,1,str,0x01,0x02);
		
		LCD_BarHorizont(1,60,5,50,buf1[1]/2,0x01,0x00);
		sprintf(str,"Ch2 = %d", buf1[1]);
		StringCalibriLight14(6,60,str,0x01,0x02);
		
		sprintf(str,"Длит. наж - Настройка");
		StringCalibriLight14(20,1,str,0x01,0x02);
		buf1[4] = 0;
//---------------------- Переход в подменю -------------------------------		
		if (But1.ButEvent == 2 && Menu == 11) {
			LCD_RectFill(1,1,32,128,0x00);
			StringCalibriLight14(1,1,"Для выхода длинно",0x01,0x02);	
			StringCalibriLight14(14,1,"нажмите кнопку",0x01,0x02);
			PrintBuf();
			Menu++;
			OptionFlag = 1; // Перешли в режим настройки
			HAL_Delay(1500);
			if (Menu>14) Menu = 12;
			But1.ButEvent = 0;
		}
//---------------------- Переход в подменю -------------------------------
//-------------------------- Подменю 1 -----------------------------------		
		if (Menu == 12){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Max влево=%d", RX_BUF[0]);
			StringCalibriLight14(6,1,str,0x01,0x02);
			buf1[4] = 2; // 4 - настройка центра рулевой машинки.
			NRF24L01_Send(buf1);
			HAL_Delay(3);
			
			if (RX_BUF[0] > 0 && RX_BUF[4] == 2) { // если данные от приемника пришли.
				if (TIM1->CNT == 1) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] + 1;
				}
				if (TIM1->CNT == 3) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] - 1;
				}
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 11;
				OptionFlag = 0;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 13;
				RX_BUF[0] = 0;
				RX_BUF[4] = 0;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 1 -----------------------------------
//-------------------------- Подменю 2 -----------------------------------		
		if (Menu == 13){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Max вправо=%d", RX_BUF[0]);
			StringCalibriLight14(6,1,str,0x01,0x02);
			buf1[4] = 3; // 4 - настройка центра рулевой машинки.
			NRF24L01_Send(buf1);
			HAL_Delay(3);
			
			if (RX_BUF[0] > 0 && RX_BUF[4] == 3) { // если данные от приемника пришли.
				if (TIM1->CNT == 1) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] + 1;
				}
				if (TIM1->CNT == 3) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] - 1;
				}
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 11;
				OptionFlag = 0;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 14;
				RX_BUF[0] = 0;
				RX_BUF[4] = 0;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 2 -----------------------------------
//-------------------------- Подменю 3 -----------------------------------		
		if (Menu == 14){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Центр - %d", RX_BUF[0]);
			StringCalibriLight14(6,60,str,0x01,0x02);
			buf1[4] = 5; // 5 - настройка центра рулевой машинки.
			NRF24L01_Send(buf1);
			HAL_Delay(3);
			
			if (RX_BUF[0] > 0 && RX_BUF[4] == 5) { // если данные от приемника пришли.
				if (TIM1->CNT == 1) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] + 1;
				}
				if (TIM1->CNT == 3) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] - 1;
				}
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 11;
				OptionFlag = 0;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 15;
				RX_BUF[0] = 0;
				RX_BUF[4] = 0;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 3 -----------------------------------
//-------------------------- Подменю 4 -----------------------------------		
		if (Menu == 15){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Макс. мощ - %d", RX_BUF[0]);
			StringCalibriLight14(6,1,str,0x01,0x02);
			buf1[4] = 6; // 4 - настройка центра рулевой машинки.
			NRF24L01_Send(buf1);
			HAL_Delay(3);
			
			if (RX_BUF[0] > 0 && RX_BUF[4] == 6) { // если данные от приемника пришли.
				if (TIM1->CNT == 1) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] + 1;
				}
				if (TIM1->CNT == 3) {
					TIM1->CNT = 2;
					buf1[0] = RX_BUF[0] - 1;
				}
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 11;
				OptionFlag = 0;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 12;
				RX_BUF[0] = 0;
				RX_BUF[4] = 0;
				But1.ButEvent = 0;
			}
		}
	}
//-------------------------- Подменю 4 -----------------------------------
//======================= Первый уровень меню ==========================

//======================= Второй уровень меню ==========================
	if (Menu>20 && Menu<30) {
		LCD_RectFill(1,1,32,128,0x00);
		sprintf(str,"Батарея пульта = %.1f В", Volt);
		StringCalibriLight14(1,1,str,0x01,0x02);
		
//		LCD_BarHorizont(1,60,5,50,(uint8_t)100 - (100/1.7)*(6 - Volt),0x01,0x00);
		
		memcpy(&VoltRx, RX_BUF, 4);
		sprintf(str,"Батарея борта = %.1f В", VoltRx);
		StringCalibriLight14(20,1,str,0x01,0x02);
		buf1[4] = 1;
	}
//======================= Второй уровень меню ==========================	

