Deman75/stm32f103_nrf24_tx/Src/main.c
//======================= Третий уровень меню ==========================
	if (Menu>30 && Menu<40) {
		LCD_RectFill(1,1,32,128,0x00);
		sprintf(str,"Дополнительные каналы");
		StringCalibriLight14(1,1,str,0x01,0x02);
		sprintf(str,"Длит. наж - Настройка");
		StringCalibriLight14(20,1,str,0x01,0x02);
		buf1[4] = 0;
//---------------------- Переход в подменю -------------------------------		
		if (But1.ButEvent == 2 && Menu == 31) {
			LCD_RectFill(1,1,32,128,0x00);
			Menu++;
			if (Menu>35) Menu = 32;
			But1.ButEvent = 0;
		}
//---------------------- Переход в подменю -------------------------------
//-------------------------- Подменю 1 -----------------------------------		
		if (Menu == 32){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Ch1 = %d", CheckBits(buf1[2],0));
			StringCalibriLight14(2,3,str,0x01,0x02);
			LCD_Rect(1,1,15,41,0x01);
			sprintf(str," Для выхода");
			StringCalibriLight14(1,50,str,0x01,0x02);
			sprintf(str,"длит. нажатие");
			StringCalibriLight14(14,50,str,0x01,0x02);
			
			if (TIM1->CNT == 1) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(1,buf1[2],0);
			}
			if (TIM1->CNT == 3) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(0,buf1[2],0);
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 31;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 33;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 1 -----------------------------------
//-------------------------- Подменю 2 -----------------------------------		
		if (Menu == 33){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Ch2 = %d", CheckBits(buf1[2],1));
			StringCalibriLight14(2,3,str,0x01,0x02);
			LCD_Rect(1,1,15,41,0x01);
			sprintf(str," Для выхода");
			StringCalibriLight14(1,50,str,0x01,0x02);
			sprintf(str,"длит. нажатие");
			StringCalibriLight14(14,50,str,0x01,0x02);
			
			if (TIM1->CNT == 1) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(1,buf1[2],1);
			}
			if (TIM1->CNT == 3) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(0,buf1[2],1);
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 31;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 34;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 2 -----------------------------------
//-------------------------- Подменю 3 -----------------------------------		
		if (Menu == 34){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Ch3 = %d", CheckBits(buf1[2],2));
			StringCalibriLight14(2,3,str,0x01,0x02);
			LCD_Rect(1,1,15,41,0x01);
			sprintf(str," Для выхода");
			StringCalibriLight14(1,50,str,0x01,0x02);
			sprintf(str,"длит. нажатие");
			StringCalibriLight14(14,50,str,0x01,0x02);
			
			if (TIM1->CNT == 1) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(1,buf1[2],2);
			}
			if (TIM1->CNT == 3) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(0,buf1[2],2);
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 31;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 35;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 3 -----------------------------------
//-------------------------- Подменю 4 -----------------------------------		
		if (Menu == 35){
			LCD_RectFill(1,1,32,128,0x00);
			sprintf(str,"Ch4 = %d", CheckBits(buf1[2],3));
			StringCalibriLight14(2,3,str,0x01,0x02);
			LCD_Rect(1,1,15,41,0x01);
			sprintf(str," Для выхода");
			StringCalibriLight14(1,50,str,0x01,0x02);
			sprintf(str,"длит. нажатие");
			StringCalibriLight14(14,50,str,0x01,0x02);
			
			if (TIM1->CNT == 1) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(1,buf1[2],3);
			}
			if (TIM1->CNT == 3) {
				TIM1->CNT = 2;
				buf1[2] = SetResBits(0,buf1[2],3);
			}
			if (TIM1->CNT<1 || TIM1->CNT>3) TIM1->CNT = 2;
			
			if (But1.ButEvent==2){
				Menu = 31;
				But1.ButEvent = 0;
			}
			if (But1.ButEvent==1){
				Menu = 32;
				But1.ButEvent = 0;
			}
		}
//-------------------------- Подменю 4 -----------------------------------
	}
	PrintBuf();
}
//======================= Третий уровень меню ==========================

void Display (void) {
	
};

uint8_t SetResBits (uint8_t set, uint8_t value, uint8_t pos){ // set==1 - Установить бит
	if (set) {
		return  value |(1 << pos);
	}
	else {
		return value & (~(1 << pos));
	}
}

uint8_t CheckBits (uint8_t value, uint8_t pos){
	if (value & (1<<pos))
		return 1;
	else 
		return 0;
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
